[
  {
    "title": "How much life insurance do I actually need?",
    "content": [
      "Determining your life insurance needs depends on various factors like your income, debts, and future expenses.",
      "A general rule of thumb is to aim for coverage that's 5-10 times your annual income.",
      "However, it's crucial to consider your specific circumstances, such as outstanding debts, education expenses for dependents, and future financial goals.",
      "Consulting with our financial advisor can help tailor a policy that adequately protects your loved ones and aligns with your long-term plans."
    ]
  },
  {
    "title": "How can I be sure I'm getting the best rates?",
    "content": [
      "At our agency, ensuring you get the best rates is our priority.",
      "We leverage our extensive network and expertise to scout for the most competitive offers tailored to your needs.",
      "Our transparent approach means you'll always know you're getting the best deal available.",
      "We continuously monitor the market to keep your rates optimized. Trust in our commitment to securing your financial future at the most favourable terms."
    ]
  },
  {
    "title": "How long does it take to get approved for life insurance coverage?",
    "content": [
      "The approval process for life insurance coverage typically ranges from a few days to several weeks.",
      "Factors such as the type of policy, your health, and the insurer's underwriting process influence the timeline.",
      "Generally, simpler policies like term life insurance may be approved more quickly, while complex policies or those requiring medical exams may take longer.",
      "Rest assured, we strive to expedite the process while ensuring thoroughness to provide you with the best coverage efficiently."
    ]
  },
  {
    "title": "What happens if I outlive the term of my life insurance policy?",
    "content": [
      "If you outlive the term of your life insurance policy, there are several options available.",
      "You can choose to renew the policy, convert it to a permanent life insurance policy if available, or simply let it expire.",
      "It's important to review your options with your insurance provider to determine the best course of action based on your current needs and financial situation.",
      "Additionally, some policies may offer the option to receive a payout of the premiums paid, though this varies depending on the terms of your policy."
    ]
  },
  {
    "title": "How can I ensure my life insurance policy adequately protects my loved ones?",
    "content": [
      "To ensure your life insurance adequately protects your loved ones, start by assessing your family's financial needs and future obligations.",
      "Consider factors like mortgage payments, education expenses, and living costs.",
      "Next, work closely with our expert advisors to tailor a policy that aligns with your unique circumstances and provides sufficient coverage.",
      "Regularly review and update your policy to accommodate any changes in your life situation.",
      "Rest assured, our commitment to personalized guidance ensures your loved ones are safeguarded against life's uncertainties."
    ]
  }
]
